/************************************************************
 * Berlin Brown
 * bigbinc@hotmail.com
 ***********************************************************
 *
 * $Id: misc.c,v 1.1 2004/03/14 03:23:59 bigbinc Exp $
 *
 * misc.c
 *
 * remember we are running a little short on space
 *
 * combination of gzip.c / vsprintf.c / misc.c / ctype
 *
 * Why didnt you do the normal thing and modularize
 *   place in headers and different files.... I am not normal...
 *
 * some code taken from gcc3.2.2 src
 *  because they have decided to hide stuff in their core engine
 *
 * - (placed printf code here for debugging)
 * 
 * This is a collection of several routines from gzip-1.0.3 
 * adapted for Linux.
 *
 * malloc by Hannu Savolainen 1993 and Matthias Urlichs 1994
 * puts by Nick Holloway 1993, better puts by Martin Mares 1995
 * High loaded stuff by Hans Lermen & Werner Almesberger, Feb. 1996
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
 * A PARTICULAR PURPOSE ARE DISCLAIMED.
 *
 * See LICENSE.OCTANE for more details
 ***********************************************************
 */

#include <stdarg.h>

#include <asm/segment.h>
#include <asm/io.h>

// taken from linkage and other _STDLIB_H_ headers
#ifdef __cplusplus
#define CPP_ASMLINKAGE extern "C"
#else

#define asmlinkage CPP_ASMLINKAGE __attribute__((regparm(0)))

#undef NULL
#if defined(__cplusplus)
#define NULL 0
#else
#define NULL ((void *)0)
#endif

#define INT_MAX                ((int)(~0U>>1))
#define INT_MIN                (-INT_MAX - 1)


#define _U      0x01
#define _L      0x02
#define _D      0x04
#define _C      0x08
#define _P      0x10
#define _S      0x20
#define _X      0x40
#define _SP     0x80


#define do_div(n,base) ({ \
	unsigned long __upper, __low, __high, __mod; \
	asm("":"=a" (__low), "=d" (__high):"A" (n)); \
	__upper = __high; \
	if (__high) { \
		__upper = __high % (base); \
		__high = __high / (base); \
	} \
	asm("divl %2":"=a" (__low), "=d" (__mod):"rm" (base), "0" (__low), "1" (__upper)); \
	asm("":"=A" (n):"a" (__low),"d" (__high)); \
	__mod; \
})

//============================================================
// DEFAULT(typedefs)
//============================================================

typedef unsigned char  uch;
typedef unsigned short ush;
typedef unsigned long  ulg;

// Just in case I dont like the compilers work
//
//  va_list/va_args/ blah are gcc dependent, try not write the code yourself?

//============================================================
//
// DEFINES
//
//============================================================
#define DEBG(x)
#define DEBG1(x)

#define slide window

#define wp outcnt
#define flush_output(w) (wp=(w),flush_window())

#define CRC_VALUE (crc ^ 0xffffffffL)


#define NEXTBYTE()  (uch)get_byte()
#define NEEDBITS(n) {while(k<(n)){b|=((ulg)NEXTBYTE())<<k;k+=8;}}
#define DUMPBITS(n) {b>>=(n);k-=(n);}


#define BMAX 16         /* maximum bit length of any code (16 for explode) */
#define N_MAX 288       /* maximum number of codes in any set */

#define ASCII_FLAG   0x01 /* bit 0 set: file probably ASCII text */
#define CONTINUATION 0x02 /* bit 1 set: continuation of multi-part gzip file */
#define EXTRA_FIELD  0x04 /* bit 2 set: extra field present */
#define ORIG_NAME    0x08 /* bit 3 set: original file name present */
#define COMMENT      0x10 /* bit 4 set: file comment present */
#define ENCRYPTED    0x20 /* bit 5 set: file is encrypted */
#define RESERVED     0xC0 /* bit 6,7:   reserved */

// INFLATE.C above MISC.C below

#define OF(args)  args
#define STATIC static

#undef memset
#undef memcpy

#define memzero(s, n)     memset ((s), 0, (n))
#define WSIZE 0x8000
		   
#define get_byte()  (inptr < insize ? inbuf[inptr++] : fill_inbuf())
		
#ifdef DEBUG
#  define Assert(cond,msg) {if(!(cond)) error(msg);}
#  define Trace(x) fprintf x
#  define Tracev(x) {if (verbose) fprintf x ;}
#  define Tracevv(x) {if (verbose>1) fprintf x ;}
#  define Tracec(c,x) {if (verbose && (c)) fprintf x ;}
#  define Tracecv(c,x) {if (verbose>1 && (c)) fprintf x ;}
#else
#  define Assert(cond,msg)
#  define Trace(x)
#  define Tracev(x)
#  define Tracevv(x)
#  define Tracec(c,x)
#  define Tracecv(c,x)
#endif

struct screen_info {
  unsigned char  orig_x;                  /* 0x00 */
  unsigned char  orig_y;                  /* 0x01 */
  unsigned short dontuse1;                /* 0x02 -- EXT_MEM_K sits here */
  unsigned short orig_video_page;         /* 0x04 */
  unsigned char  orig_video_mode;         /* 0x06 */
  unsigned char  orig_video_cols;         /* 0x07 */
  unsigned short unused2;                 /* 0x08 */
  unsigned short orig_video_ega_bx;       /* 0x0a */
  unsigned short unused3;                 /* 0x0c */
  unsigned char  orig_video_lines;        /* 0x0e */
  unsigned char  orig_video_isVGA;        /* 0x0f */
  unsigned short orig_video_points;       /* 0x10 */
};


#define EXT_MEM_K   (*(unsigned short *)(real_mode + 0x2))
#define SCREEN_INFO (*(struct screen_info *)(real_mode+0))

#define _KERNEL_MESSAGE   (*( unsigned short *)(real_mode + 0x0B))
#define _KERNEL_VERSION   (*( unsigned short *)(real_mode + 0x0e))


#define INPLACE_MOVE_ROUTINE  0x1000
#define LOW_BUFFER_START      0x2000
#define LOW_BUFFER_MAX        0x90000
#define HEAP_SIZE             0x3000

#define ZEROPAD	1
#define SIGN	2
#define PLUS	4
#define SPACE	8
#define LEFT	16
#define SPECIAL	32
#define LARGE	64


//============================================================
//
// END Defines 
//
//============================================================


//============================================================
//
// GLOBALS
//
//============================================================

struct huft {
  uch e;                /* number of extra bits or operation */
